
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "The food was great and there was no line!! At our local Din Tai Fung in California, it is impossible to get a reservation and the wait time is always more than one hour if you are lucky. The XLB are scrumptious. Best XLB around!! We came her twice in our short stay of 5 days.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "I went here by myself yesterday and arrived to a crazy long line because of the Chinese New Year holiday! But to my surprise I was seated in about 10-15 minutes. I think what took the longest about of time was really the food itself, which came out about 20 minutes after being seated. I was okay with this and knew to expect this because one of the servers informed me so. I got the beef noodle soup, spinach with garlic and the pork steamed dumplings. The dumplings are a must! They're perfectly chewy with a great depth of flavor with the soup/meat itself! The beef noodle soup just wasn't for me. I don't think it's horrible, but it just wasn't what I expected. and the spinach was amazing as well - it's definitely a must. It was pretty affordable, which I appreciated as well!The reason why I gave it only 4 stars is because the overall experience wasn't great and I have to say that I've had better quality plates at other places. But like a said, it's definitely worth a try!", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Andrew and I always wondered how Din Tai Fung (DTF) can consistently keep their rich flavour after opening many branches around the world. We visited a few Din Tai Fung restaurants when we were in Singapore and were blown away at their good quality control. At the same time we also thought that we were just lucky... ;-)Two things that we always ordered in Din Tai Fung were their shrimp &amp; pork shao mai and of course the 18 folds original Xiao Long Bao. DTF's xiao long bao is really in the league of their own. Honestly we never found any broken dumpling skin although I never really counted the number of folds on their dumpling.The shao mai was also always very delicious with plenty of pork meats inside. I always add vinegar to shao mai and the xiao long bao as I love the additional sour flavour on the meat. Of course the price of their dishes are more than the other Chinese restaurants but the quality never disappoints us.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "The sun set as the darkness came quickly at around 6pm. Having exposed ourselves exploring Singapore under extreme heat, we couldn't help but finding ourselves dining in a cool AC top-notch restaurant like Ding Tai Fung. This Taiwanese establishment is located right in the heart of Orchard area. Famously known for its Xiao Long Bao, Ding Tai Fung also features a bunch of other dimsum goodness, which we were determined to try them all out.We started with a refreshing dish of Oriental salad. The salad was crunchy and delicious, with standout ingredients like bean sprouts, Korean glass noodles and vinegar, which we believe is a perfect match to create the appetite since vinegar dressing salad is our favorite. Afterwards, here came our Steamed Pork Dumplings (Xiao Long Bao), Steamed Shrimp &amp; Pork Shaomai, Steamed Vegetable &amp; Pork Buns, and Steamed Finely Mashed Red Bean Dumplings. Of course, the spotlight should be given Xiao Long Bao. Sipping the water inside each bao is wonderful. The inside meat is well-flavored.Recommendation: Xiao Long Bao, Oriental SaladRead our full review at: thecoupleeats.com/singap…", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Couldn't decide what to eat, and stumbled on DTF. I've had such high expectations for their soup dumplings that when they came out, I was a little disappointed. Not to say they weren't good or anything, because they were but just overly hyped. The dumplings are small and succulent. The drunken chicken was moist and full of alcohol. I don't think it's a 5 star restaurant but it's good.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Omg! Another great meal, and we totally just lucked into this place. I was at Orchard Road with my mother, and we had entered one of the shopping malls to purchase some stuff from Lush and by the time the shopping was done, it was closing on 9pm, and we both were just super hungry. I had noticed a food court level located in the same mall as the Lust store, so just took the elevetor up there and then looked at Yelp reviews and this one come up tops.Honestly, it wasn't a great first experience as when we approached the restaurant front of staff and asked about vegetarian options for my mother, the lady said there was nothing vegetarian available. But I asked to see menu and there _clearly_ were veg options that mum said she was interested in trying. So we got in and soon afterwards folks were turned away as the restaurant was closing at 10pm. We hurriedly ordered pretty much at random from the menu to be honest (and the list of foods ordered is in my photos), but gosh, all the food we got was so good and scrumptious, each bite was a delight and I walked away super happy to have had the opportunity/ chance to eat here (sometimes the food gods are truly with you!) My one regret however was that in rush of ordering, didn't get to try the XLB so am going to make it my mission once back in US next year, to get myself to a DTF and try this (#foodie 2016 new year resolution!)", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "The best dumplings and buns I've ever had ! The food was amazing. Highly recommended ChiliCrab bun, it is a MUST, beancurd vermicelli are quite good as well. Service- well the waiter doesnt really speak English so we kinda had like communication problem, i was quite surprise since the restaurant is located in Orchard road, you would expected them to be able to communicate in English. And you HAVE TO give tips, like why ? The service fee is only around $5, but isnt tips are supposed to be optional?", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "Back in California, there is usually a line hour deep for DTF, I was surprised that at around 8pm there was no line or wait at all here in Singapore. Same delicious, yummy dumplings but sans line.The XLB is what you get here if you didn't know, you can get other stuff but the XLB is what you should put down in the box as soon as you sit down. The food came out quickly, the cold sliced beef, the XLB, the pan fried shirmp pancake was delicious. The beer was cold and served promptly. I wish I had a DTF near me that was like this, no lines, no waiting still yummy.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "I had my first xlb experience in August when I waited over 90 minutes to eat at Din Tai Fung in Seattle. It was well worth the wait and when I found out that there are locations all over Singapore, I had to make a visit. This location is located on the top floor of the Wisma Atria which was super easy to get to from the Grand Hyatt where we were staying. I was delighted when we didn't have to wait at all and were seated immediately. They even set a carrier next to our table for all of our packages from shopping. I liked that a lot!I ordered the braised beef noodles and pork xlb which was what I had ordered in Seattle. Everything was delicious. I love that the xlb is consistent and still amazing no matter where you go to in the world. I did notice that the braised beef in my noodles was a lot more fatty that the meat pieces in Seattle. Perhaps it's the geographical preference.Another thing I noticed was my friend and I were practically the only Asian people in the restaurants making me think there are probably many xlb restaurants that give DTF a run for their money. But no matter, love the xlb here and had a great lunch.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "After touring on the Singapore Hop On Hop Off \"yellow\" bus for the morning, we spotted a familiar restaurant from China and the US. Din Tai Fung known for their delicate Siu Loong Baus. Since we were hungry for a late lunch, we hopped off at the Orchard Road stop and headed upstairs to L4 of the Japanese shopping center.Had the Vinegar Based Salad, Shanghainese Chicken, Pork Siu Loong Baus, and Minced Pork &amp; Mushroom Noodles. Tea refilled constantly. High quality food and service consistent with the chain. Having non chain restaurant food tonight!", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Xiao long baos are amazing as with their other outlets-only complain would be the smell (which somewhat resembles that of when you enter a gym??) Would strongly recommend the yam xiaolongbaos filled with ornee as well as their crab meat xiao long baos :)", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "3.0", "review": "I had heard so much about Din Tai Fung that I was in a crazy pursuit after these bloody dumplings - never making it, until tonight.First off, staff is very nice, mostly. We arrived an hour before closing time. Before being able to order, we were told which dumplings they had run out of. My husband does not eat meat so it wasn't nice to hear that all of the fish dumplings and most of the vegetarian options were gone. But then again we were late.So we ordered a concoction of food that was mostly noodles and veggies, and 6 pieces of crab meat &amp; pork dumplings (for me). The order was placed shortly after 9 pm.Everyone around us seemed to be getting food (the place was relatively empty though) fast.Our first order arrived at around 9:35, everything else in about 5-minute-iterations, with a staff member asking us at 9:30 if we wanted to place a last order - which was a tad bizarre, with no other food having arrived yet. Also we had the dumpling-delivery-people stopping by our table often - only to carry on walking again after checking the contents - pretty funny, if you are NOT hungry that is. We finally had nearly all of our food (following a dumpling mix-up), when I was asked to pay and come to the till - where I had to wait for someone else to pay.Back to my- nearly cold - food, the last order arrived: the crab meat &amp; pork dumplings, with samples of black hair. I stopped a waiter who immediately offered a replacement. That took some time, which made the whole experience very late - with the supervisor apologising profusely, for both the wait and the hair situation.All in all, food was just ok. Pretty bland.Two stars for the wait staff, one for food. I guess we just hit a bad day but I won't be back, especially since my husband found that there is a huge difference in quality between here and Taipei. Taipei it shall be then, next time :-)", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Decided to give the restaurant a go after reading reviews on Yelp &amp; other sites. We had a 15 minute wait in the que, but received a list to record our order....had to get my own menu.We ordered hot &amp; sour soup. The soup was okay, not as flavorful as I was hoping.....edible after adding some vinager &amp; spice.Our favorites were the chili crab buns and dumplings. The service was attentive and efficient. The only complaint was Jasmine tea was brought to the table without requesting it, so we thought it was complimentary. Upon checking the bill, we were charged $1.00/person......not a huge deal, but at least ask the customer if it is wanted. Other than that, a very pleasant, affordable meal.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "Extra points just for being seated right away (we got there at around 11:30). In the US, two hour waits can be the norm, but there are just too many good food options here in Singapore.This Din Tai Fung was conveniently located in the Wisma Atria mall on there 4th floor (by the way, another incredible food court on this level as well), and was right across the street from our hotel. Wanting to see how it compares to the one in Bellevue, WA, we had an early lunch here. We ordered:Seaweed salad and tofu with honey sauce appetizers: both were good. I had the seaweed salad before, but the tofu dish was new to me: nice way to start the meal.Fried shrimp pancake: this was new to me as well, and was my favorite dish. Love how crispy and not greasy it was.Shrimp fried rice: standard but good.Shrimp and Chinese gourd dumplings: just ok: not that big of a fan of the gourd.Chili crab bun: this was really good, but you order them one each (should have gotten another one).Overall, very similar to the Din Tai Fung's in the US. No wait to be seated, but we did have a long wait for our food, though.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "4.0", "review": "The 'xiao long bao' is very good-juicy and succulent. The skin is thin and perfect texture. It's also always fun to see them making the dumplings. Service is generally good and the selection is wide. Only downside is the long wait", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "While this is a chain and local in Singapore, it was my first time experiencing it and it didn't disappoint. Located near Tang Plaza it was an easy walk from the Marriott we were staying at. The wait wasn't long and the view overlooked the Main Street of the high end shopping district.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "I am in love.Instead of setting a portrait of my spouse on my bedside table when I travel to Singapore, I will be placing the business card from Din Tai Fung, which features a picture of a plump xiao long bao, on the table next to my bed.Soft, juicy pillows of steaming xiao long bao whispered delicious pork nothings to me last night during my first visit to the Orchard branch of Din Tai Fung, how could I have been so blind to this love affair in the making?What is so amazing about Din Tai Fung is that it is a large chain restaurant by the BreadTalk group, a type of business that I would never or rarely patronize, but the quality was simply decadent. The service was average to nearly poor, however, the food was so spectacular, the rating could be nothing less than than a five star.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "I love you, DTF. I've been eating here (at various branches) a long, long time, and it only gets better. No-brainer order: get the xiao long bao, the beef brisket noodle soup and the dou miao (pea shoot greens with garlic). End of story.", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "5.0", "review": "When reading reviews, I'm the kind of person that just looks for food recommendations and skips everything else, so let's get straight to it :)Split between 3 people.Fully vegetarian options, first:- Steamed Veg dumplings (10pcs) - 2x- Hong Kong Kailan with Special Sauce- Nao Bai with Garlic- Stewed Bean Curd Cubes with Honey SauceMy FAVORITE meat option that I've had thus far:- Oriental Wontons with Black Vinegar and Chili Oil (if you're not a vegetarian, PLEASE get this)- Steamed Pork DumplingsComes out to about 30-40 sgd per person, and you eat like royalty. I'm dying to try the Pork and Truffle Dumplings :)", "title": "Din Tai Fung"},
{"url": "https://www.yelp.com.sg/biz/din-tai-fung-singapore-5?hrid=3oAFVEZhEtAgUyvKgJjdiA", "rating": "3.0", "review": "I'm not an expert in this type of food, so feel free to ignore me, but I can only go on what my taste buds told me when I visited. These may have been the most authentic buns and dumplings, but they just did not taste as good as some other ones that i have eaten in the past. \"A bit bland\" is probably the best way I can describe the food. Perhaps it was our selections that were off, but there is a bit of pressure when you are not even allowed into the restaurant until you have picked your food! Genuinely had really high food hopes for this places based on previous reviews and personal local recommendations, but for me it was all a bit ....\"meh\" taste-wise. Just scrapes a 3 star rating for dumplings in a shopping centre.", "title": "Din Tai Fung"}